Repository: dhthoreau/one-time-bits
Catalog: otb-demo-app/po/*.po
Languages: it

source: There was a failure saving local encryption data.
it: Si è verificato un errore di salvataggio dei dati locali di crittografia.

source: There was a failure generating encryption keys.
it: Si è verificato un errore di generazione delle chiavi di crittografia.

source: There was a failure saving your profile to disk.
it: Si è verificato un errore di salvataggio del tuo profilo sul disco.

source: Some inputs are invalid and are highlighted in red. Please correct them and try again.
it: Alcuni campi non sono validi e vengono evidenziati in rosso. Correggi e riprova.

source: Name
it: Nome

source: The name of the user
it: Il nome dell'utente

source: _Cancel
it: _Annulla

source: _Export
it: _Esporta

source: There was an error exporting the data.
it: Si è verificato un errore di esportazione dei dati.

source: _Import
it: _Importa

source: There was an error importing the data.
it: Si è verificato un errore di importazione dei dati.

source: There was an error loading the data.
it: Si è verificato un errore di caricamento dei dati.

source: Please enter a passphrase.
it: Inserisci pure una frase d'accesso.

source: Incorrect passphrase. Please try again.
it: La frase d'accesso non è giusta. Prova ancora una volta.

source: Failed to load CSS.
it: Non è riuscito a caricare CSS.
