Repository: dhthoreau/one-time-bits
Catalog: po/*.po
Languages: it

source: Unique ID
it: ID univoco

source: UUID of the user
it: UUID dell'utente

source: Asymetrical cipher
it: Cifra asimmetrica

source: Asymetrical cipher that is used to identify the user and communicate with friends
it: Cifra asimmetrica usata per identificare l'utente e comunicare con amici.

source: Address
it: Indirizzo

source: The address of the user
it: L'indirizzo dell'utente

source: Failed to load key file from %s. Error == %s
it: Non è riuscito a aprire il file di chiave %s. Errore == %s

source: Base path
it: Precorso di base

source: Directory where the friend's data will be saved
it: La directory dove i dati del amico saranno salvati

source: Incoming pads
it: Blocchi in arrivo

source: Database of incoming pads
it: Il database di blocchi in arrivo

source: Outgoing pads
it: Blocchi in partenza

source: Database of outgoing pads
it: Il database di blocchi in partenza

source: UUID of the friend
it: UUID dell'amico

source: Public key
it: Chiave pubblica

source: Key that is used to identify the friend
it: La chiave usata per identificare l'amico

source: Transport cipher
it: Cifra di trasporto

source: The cipher used for data transport
it: La cifra per trasportare i dati

source: The address of the friend
it: L'indirizzo dell'amico

source: Tried to change unique ID of a friend.
it: Si è provato a cambiare ID univoco d'un amico.

source: Failed to generate random data. Error == %s
it: Non è riuscito a generare dati casuali. Errore == %s

source: Failed to add locked page to hash table.
it: Non è riuscito ad aggiungere pagina bloccata a tabella hash.

source: Locked page already exists in hash table. Likely cause is calling free() instead of otb_free_locked().
it: Pagina bloccata esista già in tabella hash. La causa probabile è chiamare free() invece otb_free_locked().

source: otb_munlock_page() failed.
it: otb_munlock_page() non è ruiscito.

source: Memory already exists in hash table. Likely cause is calling free() instead of otb_free_locked().
it: Memoria esista già in tabella hash. La causa probabile è chiamare free() invece otb_free_locked().

source: Failed to remove memory from hash table.
it: Non è riuscito ad eliminare memoria da tabella hash.

source: UUID of the record
it: UUID del record

source: Status
it: Stato

source: Status of the record
it: Stato del record

source: Directory where the record will be saved
it: La directory dove il record sarà salvato

source: Base name
it: Name di base

source: Name of file where the record will be saved, excluding file extension
it: Il nome del file per salvare il record, senza estensione

source: Size
it: Dimensione

source: Size of the pad file
it: Dimensione del file di blocco

source: Expiration
it: Scadenza

source: The date and time when the pad expires (microseconds from 1-Jan-1979 UTC)
it: La data e l'ora in cui il blocco scade (microsecondi da 1-gen-1979 UTC)

source: User
it: Utente

source: The user who is using the application
it: L'utente chi sta usando l'applicazione

source: Proxy port
it: Porta della delega

source: The port for the local proxy, preferably TOR
it: Porta della delega locale, preferibilmente TOR

source: Pad synchronization interval
it: Intervallo della sincronizzazione dei blocchi

source: How often pads should be synchronized, measured in microseconds
it: Quanto spesso i blocchi dovrebbero essere sincronizzati, misurato con microsecondi

source: Failed to open file %s. Error == %s
it: Non è riuscito a aprire il file %s. Errore == %s

source: Failed to write file. Error == %s
it: Non è riuscito a scrivere un file. Errore == %s

source: Failed to read file. Error == %s
it: Non è riuscito a leggere un file. Errore == %s

source: Failed close file. Error == %s
it: Non è riuscito a chiudere un file. Errore == %s

source: Failed delete file %s. Error == %s
it: Non è riuscito a cancellare un file %s. Errore == %s

source: Failed create directory %s. Error == %s
it: Non è riuscito a creare la directory %s. Errore == %s

source: Failed open directory %s. Error == %s
it: Non è riuscito a aprire la directory %s. Errore == %s

source: The public key to use for encryption
it: La chiave pubblica che è usata per crittografia

source: Symmetric cipher
it: Cifra simmetrica

source: Name of the symmetric cipher to use
it: Nome della cifra simmetrica per utilizzare

source: Failed to initialize encryption. Error == %s
it: Non è riuscito ad inizializzare la crittografia. Errore == %s

source: Failed to initialize decryption. Error == %s
it: Non è riuscito ad inizializzare la decrittazione. Errore == %s

source: Failed to encrypt data. Error == %s
it: Non è riuscito a cifrare dati. Errore == %s

source: Failed to decrypt data. Error == %s
it: Non è riuscito a decifrare dati. Errore == %s

source: Failed to encrypt final data. Error == %s
it: Non è riuscito a cifrare dati finali. Errore == %s

source: Failed to decrypt final data. Error == %s
it: Non è riuscito a decifrare dati finali. Errore == %s

source: Directory where the database will be saved
it: La directory dove il database sarà salvato

source: Max size
it: Dimensione massima

source: Maximum size of the database
it: Dimensione massima del database

source: New pad min size
it: Dimensione minima di blocchi nuovi

source: Minimum size for a newly created pad
it: Dimensione minima di blocchi creati di fresco

source: New pad max size
it: Dimensione massima di blocchi nuovi

source: Maximum size for a newly created pad
it: Dimensione massima di blocchi creati di fresco

source: New pad expiration
it: Scadenza dei blocchi nuovi

source: Time interval of expiration for a newly created pad
it: Intervallo di tempo di scadenza di blocchi creati di fresco

source: Failed to add record due to non-unique ID.
it: Non è riuscito ad aggiungere record a causa di ID non univoco.

source: Failed to add record due to database size limitation.
it: Non è riuscito ad aggiungere record a causa di la limitazione di dimensione del database.

source: Failed to update the status of all pads used to encrypt a file, though file itself was fully encrypted. This could cause problems for the recipient of your encrypted files. Recomendation is that the encrypted file not be used.
it: Non è riuscito a aggiornare lo stato di tutti blocchi utilizzati per cifrare un file, sebbene il file era cifrato completamente. Quello potrebbe causare problemi per il destinatario dei tuoi file cifrati. La raccomandazione è che il file cifrato non sia utilizzato.

source: Failed to decrypt file due to unsupported file version number.
it: Non è riuscito a decifrare il file a causa di numero di versione non supportata di file.

source: Failed to delete all pads used to decrypt a file, though file itself was fully decrypted. Recomendation is reset the pad database.
it: Non è riuscito a cancellare tutti blocchi utilizzati per decifrare un file, sebbene il file era decifrato completamente. La raccomandazione è azzerare il database di blocchi.

source: Cipher
it: Cifra

source: Name of the cipher to use
it: Nome della cifra per utilizzare

source: Message digest to use for hashes
it: Il message digest da utilizzare per hash

source: Hash iterations
it: Iterazioni di hash

source: Number of iterations to go through when hashing
it: Il numero di iterazioni da fare hash.
